docs/posts/2016-12-13-the-offensive-jesus.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 29, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Offensive Jesus</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Offensive Jesus</h1>
<p class="subtitle" role="doc-subtitle">Dec 13, 2016</p>
</header><p>
The Gospel text for the third Sunday of Advent in year A is Matthew 11:2-11, which, on the surface, seems like an odd choice for the Christmas season, especially for a day known as the &ldquo;Sunday of joy.&rdquo; It opens with what is apparently some doubt on the part of John the Baptist: &ldquo;When John heard in prison what the Messiah was doing, he sent word by his disciples and said to him, &lsquo;Are you the one who is to come, or are we to wait for another?&rsquo;&rdquo;
</p>

<p>
The third chapter of Matthew records John speaking of the wrath to come and the unquenchable fire that will be used to burn the chaff. It appears that the messiah that John got did not look much like the messiah that John expected.<br>
</p>

<p>
Too often, our celebration of Christmas shows that we, like John, also would prefer another messiah. To paraphrase Ricky Bobby in Talladega Nights, we like the Christmas Jesus best – the sweet, calm, beautiful, inoffensive, unchallenging, non-threatening Jesus of the carol &ldquo;Silent Night.&rdquo; This Jesus doesn&rsquo;t call us to follow him, for he never leaves the manger, and certainly doesn&rsquo;t go to the cross. We are like John Updike&rsquo;s title character in <i>Rabbit, Run</i>, who &ldquo;&#x2026;has no taste for the dark, tangled, visceral aspect of Christianity, the going through quality of it, the passage into death and suffering that redeems and inverts these things.&rdquo;
</p>

<p>
The babe born in Bethlehem, though, would soon become the one who offended religious sensibilities and challenged the power structures of the day. In his own words, he came to preach good news to the poor and to liberate the oppressed. He was perceived by the Romans to be such a political threat that he was executed on a cross. It could very well be the case that the only person in Matthew&rsquo;s birth narrative to truly understand the implications of the event was Herod.
</p>

<p>
We feel happy at the manger, but joy is found on the road beyond — even if that road leads to the cross. So, as we search for meaning this Christmas season, may we look beyond the birth narratives to consider the Christ-hymn of Philippians 2; that this Jesus
</p>

<blockquote>
<p>
&#x2026;who, though he was in the form of God,<br>
did not regard equality with God<br>
as something to be exploited,<br>
but emptied himself,<br>
taking the form of a slave,<br>
being born in human likeness.<br>
And being found in human form,<br>
he humbled himself<br>
and became obedient to the point of death —<br>
even death on a cross.<br>
</p>
</blockquote>



<p>
Prayer:
</p>

<p>
May I come to Christmas this year<br>
seeking not the image I have created,<br>
but the Christ begotten of the Father,<br>
recognizing that the manger of Bethlehem<br>
was but the first stop on the journey to the cross.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org6c7a21a">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 29, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
